MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
extern volatile TX3PPSbits_t TX3PPSbits __at(0xE14);
// bitfield macros
#define _TX3PPS_PIN_POSN                                    0x0
#define _TX3PPS_PIN_POSITION                                0x0
#define _TX3PPS_PIN_SIZE                                    0x3
#define _TX3PPS_PIN_LENGTH                                  0x3
#define _TX3PPS_PIN_MASK                                    0x7
#define _TX3PPS_PORT_POSN                                   0x3
#define _TX3PPS_PORT_POSITION                               0x3
#define _TX3PPS_PORT_SIZE                                   0x3
#define _TX3PPS_PORT_LENGTH                                 0x3
#define _TX3PPS_PORT_MASK                                   0x38
#define _TX3PPS_TX3PPS_POSN                                 0x0
#define _TX3PPS_TX3PPS_POSITION                             0x0
#define _TX3PPS_TX3PPS_SIZE                                 0x6
#define _TX3PPS_TX3PPS_LENGTH                               0x6
#define _TX3PPS_TX3PPS_MASK                                 0x3F
#define _TX3PPS_TX3PPS0_POSN                                0x0
#define _TX3PPS_TX3PPS0_POSITION                            0x0
#define _TX3PPS_TX3PPS0_SIZE                                0x1
#define _TX3PPS_TX3PPS0_LENGTH                              0x1
#define _TX3PPS_TX3PPS0_MASK                                0x1
#define _TX3PPS_TX3PPS1_POSN                                0x1
#define _TX3PPS_TX3PPS1_POSITION                            0x1
#define _TX3PPS_TX3PPS1_SIZE                                0x1
#define _TX3PPS_TX3PPS1_LENGTH                              0x1
#define _TX3PPS_TX3PPS1_MASK                                0x2
#define _TX3PPS_TX3PPS2_POSN                                0x2
#define _TX3PPS_TX3PPS2_POSITION                            0x2
#define _TX3PPS_TX3PPS2_SIZE                                0x1
#define _TX3PPS_TX3PPS2_LENGTH                              0x1
#define _TX3PPS_TX3PPS2_MASK                                0x4
#define _TX3PPS_TX3PPS3_POSN                                0x3
#define _TX3PPS_TX3PPS3_POSITION                            0x3
#define _TX3PPS_TX3PPS3_SIZE                                0x1
#define _TX3PPS_TX3PPS3_LENGTH                              0x1
#define _TX3PPS_TX3PPS3_MASK                                0x8
#define _TX3PPS_TX3PPS4_POSN                                0x4
#define _TX3PPS_TX3PPS4_POSITION                            0x4
#define _TX3PPS_TX3PPS4_SIZE                                0x1
#define _TX3PPS_TX3PPS4_LENGTH                              0x1
#define _TX3PPS_TX3PPS4_MASK                                0x10
#define _TX3PPS_TX3PPS5_POSN                                0x5
#define _TX3PPS_TX3PPS5_POSITION                            0x5
#define _TX3PPS_TX3PPS5_SIZE                                0x1
#define _TX3PPS_TX3PPS5_LENGTH                              0x1
#define _TX3PPS_TX3PPS5_MASK                                0x20

// Register: RX4PPS
#define RX4PPS RX4PPS
extern volatile unsigned char           RX4PPS              __at(0xE15);
#ifndef _LIB_BUILD
asm("RX4PPS equ 0E15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX4PPS                 :6;
    };
    struct {
        unsigned RX4PPS0                :1;
        unsigned RX4PPS1                :1;
        unsigned RX4PPS2                :1;
        unsigned RX4PPS3                :1;
        unsigned RX4PPS4                :1;
    };
} RX4PPSbits_t;
extern volatile RX4PPSbits_t RX4PPSbits __at(0xE15);
// bitfield macros
#define _RX4PPS_PIN_POSN                                    0x0
#define _RX4PPS_PIN_POSITION                                0x0
#define _RX4PPS_PIN_SIZE                                    0x3
#define _RX4PPS_PIN_LENGTH                                  0x3
#define _RX4PPS_PIN_MASK                                    0x7
#define _RX4PPS_PORT_POSN                                   0x3
#define _RX4PPS_PORT_POSITION                               0x3
#define _RX4PPS_PORT_SIZE                                   0x2
#define _RX4PPS_PORT_LENGTH                                 0x2
#define _RX4PPS_PORT_MASK                                   0x18
#define _RX4PPS_RX4PPS_POSN                                 0x0
#define _RX4PPS_RX4PPS_POSITION                             0x0
#define _RX4PPS_RX4PPS_SIZE                                 0x6
#define _RX4PPS_RX4PPS_LENGTH                               0x6
#define _RX4PPS_RX4PPS_MASK                                 0x3F
#define _RX4PPS_RX4PPS0_POSN                                0x0
#define _RX4PPS_RX4PPS0_POSITION                            0x0
#define _RX4PPS_RX4PPS0_SIZE                                0x1
#define _RX4PPS_RX4PPS0_LENGTH                              0x1
#define _RX4PPS_RX4PPS0_MASK                                0x1
#define _RX4PPS_RX4PPS1_POSN                                0x1
#define _RX4PPS_RX4PPS1_POSITION                            0x1
#define _RX4PPS_RX4PPS1_SIZE                                0x1
#define _RX4PPS_RX4PPS1_LENGTH                              0x1
#define _RX4PPS_RX4PPS1_MASK                                0x2
#define _RX4PPS_RX4PPS2_POSN                                0x2
#define _RX4PPS_RX4PPS2_POSITION                            0x2
#define _RX4PPS_RX4PPS2_SIZE                                0x1
#define _RX4PPS_RX4PPS2_LENGTH                              0x1
#define _RX4PPS_RX4PPS2_MASK                                0x4
#define _RX4PPS_RX4PPS3_POSN                                0x3
#define _RX4PPS_RX4PPS3_POSITION                            0x3
#define _RX4PPS_RX4PPS3_SIZE                                0x1
#define _RX4PPS_RX4PPS3_LENGTH                              0x1
#define _RX4PPS_RX4PPS3_MASK                                0x8
#define _RX4PPS_RX4PPS4_POSN                                0x4
#define _RX4PPS_RX4PPS4_POSITION                            0x4
#define _RX4PPS_RX4PPS4_SIZE                                0x1
#define _RX4PPS_RX4PPS4_LENGTH                              0x1
#define _RX4PPS_RX4PPS4_MASK                                0x10

// Register: CK4PPS
#define CK4PPS CK4PPS
extern volatile unsigned char           CK4PPS              __at(0xE16);
#ifndef _LIB_BUILD
asm("CK4PPS equ 0E16h");
#endif
// aliases
extern volatile unsigned char           TX4PPS              __at(0xE16);
#ifndef _LIB_BUILD
asm("TX4PPS equ 0E16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX4PPS                 :6;
    };
    struct {
        unsigned TX4PPS0                :1;
        unsigned TX4PPS1                :1;
        unsigned TX4PPS2                :1;
        unsigned TX4PPS3                :1;
        unsigned TX4PPS4                :1;
    };
} CK4PPSbits_t;
