MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
extern volatile IPR3bits_t IPR3bits __at(0xE22);
// bitfield macros
#define _IPR3_SSP1IP_POSN                                   0x0
#define _IPR3_SSP1IP_POSITION                               0x0
#define _IPR3_SSP1IP_SIZE                                   0x1
#define _IPR3_SSP1IP_LENGTH                                 0x1
#define _IPR3_SSP1IP_MASK                                   0x1
#define _IPR3_BCL1IP_POSN                                   0x1
#define _IPR3_BCL1IP_POSITION                               0x1
#define _IPR3_BCL1IP_SIZE                                   0x1
#define _IPR3_BCL1IP_LENGTH                                 0x1
#define _IPR3_BCL1IP_MASK                                   0x2
#define _IPR3_SSP2IP_POSN                                   0x2
#define _IPR3_SSP2IP_POSITION                               0x2
#define _IPR3_SSP2IP_SIZE                                   0x1
#define _IPR3_SSP2IP_LENGTH                                 0x1
#define _IPR3_SSP2IP_MASK                                   0x4
#define _IPR3_BCL2IP_POSN                                   0x3
#define _IPR3_BCL2IP_POSITION                               0x3
#define _IPR3_BCL2IP_SIZE                                   0x1
#define _IPR3_BCL2IP_LENGTH                                 0x1
#define _IPR3_BCL2IP_MASK                                   0x8
#define _IPR3_TX1IP_POSN                                    0x4
#define _IPR3_TX1IP_POSITION                                0x4
#define _IPR3_TX1IP_SIZE                                    0x1
#define _IPR3_TX1IP_LENGTH                                  0x1
#define _IPR3_TX1IP_MASK                                    0x10
#define _IPR3_RC1IP_POSN                                    0x5
#define _IPR3_RC1IP_POSITION                                0x5
#define _IPR3_RC1IP_SIZE                                    0x1
#define _IPR3_RC1IP_LENGTH                                  0x1
#define _IPR3_RC1IP_MASK                                    0x20
#define _IPR3_TX2IP_POSN                                    0x6
#define _IPR3_TX2IP_POSITION                                0x6
#define _IPR3_TX2IP_SIZE                                    0x1
#define _IPR3_TX2IP_LENGTH                                  0x1
#define _IPR3_TX2IP_MASK                                    0x40
#define _IPR3_RC2IP_POSN                                    0x7
#define _IPR3_RC2IP_POSITION                                0x7
#define _IPR3_RC2IP_SIZE                                    0x1
#define _IPR3_RC2IP_LENGTH                                  0x1
#define _IPR3_RC2IP_MASK                                    0x80
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0xE23);
#ifndef _LIB_BUILD
asm("IPR4 equ 0E23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX3IP                  :1;
        unsigned RC3IP                  :1;
        unsigned TX4IP                  :1;
        unsigned RC4IP                  :1;
        unsigned TX5IP                  :1;
        unsigned RC5IP                  :1;
    };
    struct {
        unsigned CCIP3IP                :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0xE23);
// bitfield macros
#define _IPR4_TX3IP_POSN                                    0x0
#define _IPR4_TX3IP_POSITION                                0x0
#define _IPR4_TX3IP_SIZE                                    0x1
#define _IPR4_TX3IP_LENGTH                                  0x1
#define _IPR4_TX3IP_MASK                                    0x1
#define _IPR4_RC3IP_POSN                                    0x1
#define _IPR4_RC3IP_POSITION                                0x1
#define _IPR4_RC3IP_SIZE                                    0x1
#define _IPR4_RC3IP_LENGTH                                  0x1
#define _IPR4_RC3IP_MASK                                    0x2
#define _IPR4_TX4IP_POSN                                    0x2
#define _IPR4_TX4IP_POSITION                                0x2
#define _IPR4_TX4IP_SIZE                                    0x1
#define _IPR4_TX4IP_LENGTH                                  0x1
#define _IPR4_TX4IP_MASK                                    0x4
#define _IPR4_RC4IP_POSN                                    0x3
#define _IPR4_RC4IP_POSITION                                0x3
#define _IPR4_RC4IP_SIZE                                    0x1
#define _IPR4_RC4IP_LENGTH                                  0x1
#define _IPR4_RC4IP_MASK                                    0x8
#define _IPR4_TX5IP_POSN                                    0x4
#define _IPR4_TX5IP_POSITION                                0x4
#define _IPR4_TX5IP_SIZE                                    0x1
#define _IPR4_TX5IP_LENGTH                                  0x1
#define _IPR4_TX5IP_MASK                                    0x10
#define _IPR4_RC5IP_POSN                                    0x5
#define _IPR4_RC5IP_POSITION                                0x5
#define _IPR4_RC5IP_SIZE                                    0x1
#define _IPR4_RC5IP_LENGTH                                  0x1
#define _IPR4_RC5IP_MASK                                    0x20
#define _IPR4_CCIP3IP_POSN                                  0x0
#define _IPR4_CCIP3IP_POSITION                              0x0
#define _IPR4_CCIP3IP_SIZE                                  0x1
#define _IPR4_CCIP3IP_LENGTH                                0x1
#define _IPR4_CCIP3IP_MASK                                  0x1

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xE24);
#ifndef _LIB_BUILD
asm("IPR5 equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR3IP                 :1;
        unsigned TMR4IP                 :1;
        unsigned TMR5IP                 :1;
        unsigned TMR6IP                 :1;
        unsigned TMR7IP                 :1;
        unsigned TMR8IP                 :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
        unsigned                        :1;
        unsigned EVPOL05                :1;
        unsigned EVPOL15                :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0xE24);
// bitfield macros
#define _IPR5_TMR1IP_POSN                                   0x0
#define _IPR5_TMR1IP_POSITION                               0x0
#define _IPR5_TMR1IP_SIZE                                   0x1
#define _IPR5_TMR1IP_LENGTH                                 0x1
#define _IPR5_TMR1IP_MASK                                   0x1
#define _IPR5_TMR2IP_POSN                                   0x1
#define _IPR5_TMR2IP_POSITION                               0x1
#define _IPR5_TMR2IP_SIZE                                   0x1
#define _IPR5_TMR2IP_LENGTH                                 0x1
#define _IPR5_TMR2IP_MASK                                   0x2
#define _IPR5_TMR3IP_POSN                                   0x2
#define _IPR5_TMR3IP_POSITION                               0x2
#define _IPR5_TMR3IP_SIZE                                   0x1
#define _IPR5_TMR3IP_LENGTH                                 0x1
#define _IPR5_TMR3IP_MASK                                   0x4
#define _IPR5_TMR4IP_POSN                                   0x3
#define _IPR5_TMR4IP_POSITION                               0x3
#define _IPR5_TMR4IP_SIZE                                   0x1
#define _IPR5_TMR4IP_LENGTH                                 0x1
#define _IPR5_TMR4IP_MASK                                   0x8
#define _IPR5_TMR5IP_POSN                                   0x4
#define _IPR5_TMR5IP_POSITION                               0x4
#define _IPR5_TMR5IP_SIZE                                   0x1
#define _IPR5_TMR5IP_LENGTH                                 0x1
#define _IPR5_TMR5IP_MASK                                   0x10
#define _IPR5_TMR6IP_POSN                                   0x5
#define _IPR5_TMR6IP_POSITION                               0x5
#define _IPR5_TMR6IP_SIZE                                   0x1
#define _IPR5_TMR6IP_LENGTH                                 0x1
#define _IPR5_TMR6IP_MASK                                   0x20
#define _IPR5_TMR7IP_POSN                                   0x6
#define _IPR5_TMR7IP_POSITION                               0x6
#define _IPR5_TMR7IP_SIZE                                   0x1
#define _IPR5_TMR7IP_LENGTH                                 0x1
#define _IPR5_TMR7IP_MASK                                   0x40
#define _IPR5_TMR8IP_POSN                                   0x7
#define _IPR5_TMR8IP_POSITION                               0x7
#define _IPR5_TMR8IP_SIZE                                   0x1
#define _IPR5_TMR8IP_LENGTH                                 0x1
#define _IPR5_TMR8IP_MASK                                   0x80
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2
#define _IPR5_EVPOL05_POSN                                  0x3
#define _IPR5_EVPOL05_POSITION                              0x3
#define _IPR5_EVPOL05_SIZE                                  0x1
#define _IPR5_EVPOL05_LENGTH                                0x1
#define _IPR5_EVPOL05_MASK                                  0x8
#define _IPR5_EVPOL15_POSN                                  0x4
#define _IPR5_EVPOL15_POSITION                              0x4
#define _IPR5_EVPOL15_SIZE                                  0x1
#define _IPR5_EVPOL15_LENGTH                                0x1
#define _IPR5_EVPOL15_MASK                                  0x10

