MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
extern volatile SPBRG5bits_t SPBRG5bits __at(0xEDE);
// bitfield macros
#define _SPBRG5_SP5BRGL_POSN                                0x0
#define _SPBRG5_SP5BRGL_POSITION                            0x0
#define _SPBRG5_SP5BRGL_SIZE                                0x8
#define _SPBRG5_SP5BRGL_LENGTH                              0x8
#define _SPBRG5_SP5BRGL_MASK                                0xFF

// Register: SP5BRGH
#define SP5BRGH SP5BRGH
extern volatile unsigned char           SP5BRGH             __at(0xEDF);
#ifndef _LIB_BUILD
asm("SP5BRGH equ 0EDFh");
#endif
// aliases
extern volatile unsigned char           SPBRGH5             __at(0xEDF);
#ifndef _LIB_BUILD
asm("SPBRGH5 equ 0EDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP5BRGH                :8;
    };
} SP5BRGHbits_t;
extern volatile SP5BRGHbits_t SP5BRGHbits __at(0xEDF);
// bitfield macros
#define _SP5BRGH_SP5BRGH_POSN                               0x0
#define _SP5BRGH_SP5BRGH_POSITION                           0x0
#define _SP5BRGH_SP5BRGH_SIZE                               0x8
#define _SP5BRGH_SP5BRGH_LENGTH                             0x8
#define _SP5BRGH_SP5BRGH_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP5BRGH                :8;
    };
} SPBRGH5bits_t;
extern volatile SPBRGH5bits_t SPBRGH5bits __at(0xEDF);
// bitfield macros
#define _SPBRGH5_SP5BRGH_POSN                               0x0
#define _SPBRGH5_SP5BRGH_POSITION                           0x0
#define _SPBRGH5_SP5BRGH_SIZE                               0x8
#define _SPBRGH5_SP5BRGH_LENGTH                             0x8
#define _SPBRGH5_SP5BRGH_MASK                               0xFF

// Register: RC5STA
#define RC5STA RC5STA
extern volatile unsigned char           RC5STA              __at(0xEE0);
#ifndef _LIB_BUILD
asm("RC5STA equ 0EE0h");
#endif
// aliases
extern volatile unsigned char           RCSTA5              __at(0xEE0);
#ifndef _LIB_BUILD
asm("RCSTA5 equ 0EE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC5STAbits_t;
extern volatile RC5STAbits_t RC5STAbits __at(0xEE0);
// bitfield macros
#define _RC5STA_RX9D_POSN                                   0x0
#define _RC5STA_RX9D_POSITION                               0x0
#define _RC5STA_RX9D_SIZE                                   0x1
#define _RC5STA_RX9D_LENGTH                                 0x1
#define _RC5STA_RX9D_MASK                                   0x1
#define _RC5STA_OERR_POSN                                   0x1
#define _RC5STA_OERR_POSITION                               0x1
#define _RC5STA_OERR_SIZE                                   0x1
#define _RC5STA_OERR_LENGTH                                 0x1
#define _RC5STA_OERR_MASK                                   0x2
#define _RC5STA_FERR_POSN                                   0x2
#define _RC5STA_FERR_POSITION                               0x2
#define _RC5STA_FERR_SIZE                                   0x1
#define _RC5STA_FERR_LENGTH                                 0x1
#define _RC5STA_FERR_MASK                                   0x4
#define _RC5STA_ADDEN_POSN                                  0x3
#define _RC5STA_ADDEN_POSITION                              0x3
#define _RC5STA_ADDEN_SIZE                                  0x1
#define _RC5STA_ADDEN_LENGTH                                0x1
#define _RC5STA_ADDEN_MASK                                  0x8
#define _RC5STA_CREN_POSN                                   0x4
#define _RC5STA_CREN_POSITION                               0x4
#define _RC5STA_CREN_SIZE                                   0x1
#define _RC5STA_CREN_LENGTH                                 0x1
#define _RC5STA_CREN_MASK                                   0x10
#define _RC5STA_SREN_POSN                                   0x5
#define _RC5STA_SREN_POSITION                               0x5
#define _RC5STA_SREN_SIZE                                   0x1
#define _RC5STA_SREN_LENGTH                                 0x1
#define _RC5STA_SREN_MASK                                   0x20
#define _RC5STA_RX9_POSN                                    0x6
#define _RC5STA_RX9_POSITION                                0x6
#define _RC5STA_RX9_SIZE                                    0x1
#define _RC5STA_RX9_LENGTH                                  0x1
#define _RC5STA_RX9_MASK                                    0x40
#define _RC5STA_SPEN_POSN                                   0x7
#define _RC5STA_SPEN_POSITION                               0x7
#define _RC5STA_SPEN_SIZE                                   0x1
#define _RC5STA_SPEN_LENGTH                                 0x1
#define _RC5STA_SPEN_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RCSTA5bits_t;
extern volatile RCSTA5bits_t RCSTA5bits __at(0xEE0);
// bitfield macros
#define _RCSTA5_RX9D_POSN                                   0x0
#define _RCSTA5_RX9D_POSITION                               0x0
#define _RCSTA5_RX9D_SIZE                                   0x1
#define _RCSTA5_RX9D_LENGTH                                 0x1
#define _RCSTA5_RX9D_MASK                                   0x1
#define _RCSTA5_OERR_POSN                                   0x1
#define _RCSTA5_OERR_POSITION                               0x1
#define _RCSTA5_OERR_SIZE                                   0x1
#define _RCSTA5_OERR_LENGTH                                 0x1
#define _RCSTA5_OERR_MASK                                   0x2
#define _RCSTA5_FERR_POSN                                   0x2
#define _RCSTA5_FERR_POSITION                               0x2
#define _RCSTA5_FERR_SIZE                                   0x1
#define _RCSTA5_FERR_LENGTH                                 0x1
#define _RCSTA5_FERR_MASK                                   0x4
#define _RCSTA5_ADDEN_POSN                                  0x3
#define _RCSTA5_ADDEN_POSITION                              0x3
#define _RCSTA5_ADDEN_SIZE                                  0x1
#define _RCSTA5_ADDEN_LENGTH                                0x1
#define _RCSTA5_ADDEN_MASK                                  0x8
#define _RCSTA5_CREN_POSN                                   0x4
#define _RCSTA5_CREN_POSITION                               0x4
#define _RCSTA5_CREN_SIZE                                   0x1
#define _RCSTA5_CREN_LENGTH                                 0x1
#define _RCSTA5_CREN_MASK                                   0x10
#define _RCSTA5_SREN_POSN                                   0x5
#define _RCSTA5_SREN_POSITION                               0x5
#define _RCSTA5_SREN_SIZE                                   0x1
#define _RCSTA5_SREN_LENGTH                                 0x1
#define _RCSTA5_SREN_MASK                                   0x20
#define _RCSTA5_RX9_POSN                                    0x6
#define _RCSTA5_RX9_POSITION                                0x6
#define _RCSTA5_RX9_SIZE                                    0x1
#define _RCSTA5_RX9_LENGTH                                  0x1
#define _RCSTA5_RX9_MASK                                    0x40
#define _RCSTA5_SPEN_POSN                                   0x7
#define _RCSTA5_SPEN_POSITION                               0x7
#define _RCSTA5_SPEN_SIZE                                   0x1
#define _RCSTA5_SPEN_LENGTH                                 0x1
#define _RCSTA5_SPEN_MASK                                   0x80

// Register: TX5STA
#define TX5STA TX5STA
extern volatile unsigned char           TX5STA              __at(0xEE1);
#ifndef _LIB_BUILD
asm("TX5STA equ 0EE1h");
#endif
// aliases
extern volatile unsigned char           TXSTA5              __at(0xEE1);
#ifndef _LIB_BUILD
asm("TXSTA5 equ 0EE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TX5STAbits_t;
