MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
extern volatile T8CONbits_t T8CONbits __at(0xF2A);
// bitfield macros
#define _T8CON_OUTPS_POSN                                   0x0
#define _T8CON_OUTPS_POSITION                               0x0
#define _T8CON_OUTPS_SIZE                                   0x4
#define _T8CON_OUTPS_LENGTH                                 0x4
#define _T8CON_OUTPS_MASK                                   0xF
#define _T8CON_CKPS_POSN                                    0x4
#define _T8CON_CKPS_POSITION                                0x4
#define _T8CON_CKPS_SIZE                                    0x3
#define _T8CON_CKPS_LENGTH                                  0x3
#define _T8CON_CKPS_MASK                                    0x70
#define _T8CON_ON_POSN                                      0x7
#define _T8CON_ON_POSITION                                  0x7
#define _T8CON_ON_SIZE                                      0x1
#define _T8CON_ON_LENGTH                                    0x1
#define _T8CON_ON_MASK                                      0x80
#define _T8CON_OUTPS0_POSN                                  0x0
#define _T8CON_OUTPS0_POSITION                              0x0
#define _T8CON_OUTPS0_SIZE                                  0x1
#define _T8CON_OUTPS0_LENGTH                                0x1
#define _T8CON_OUTPS0_MASK                                  0x1
#define _T8CON_OUTPS1_POSN                                  0x1
#define _T8CON_OUTPS1_POSITION                              0x1
#define _T8CON_OUTPS1_SIZE                                  0x1
#define _T8CON_OUTPS1_LENGTH                                0x1
#define _T8CON_OUTPS1_MASK                                  0x2
#define _T8CON_OUTPS2_POSN                                  0x2
#define _T8CON_OUTPS2_POSITION                              0x2
#define _T8CON_OUTPS2_SIZE                                  0x1
#define _T8CON_OUTPS2_LENGTH                                0x1
#define _T8CON_OUTPS2_MASK                                  0x4
#define _T8CON_OUTPS3_POSN                                  0x3
#define _T8CON_OUTPS3_POSITION                              0x3
#define _T8CON_OUTPS3_SIZE                                  0x1
#define _T8CON_OUTPS3_LENGTH                                0x1
#define _T8CON_OUTPS3_MASK                                  0x8
#define _T8CON_CKPS0_POSN                                   0x4
#define _T8CON_CKPS0_POSITION                               0x4
#define _T8CON_CKPS0_SIZE                                   0x1
#define _T8CON_CKPS0_LENGTH                                 0x1
#define _T8CON_CKPS0_MASK                                   0x10
#define _T8CON_CKPS1_POSN                                   0x5
#define _T8CON_CKPS1_POSITION                               0x5
#define _T8CON_CKPS1_SIZE                                   0x1
#define _T8CON_CKPS1_LENGTH                                 0x1
#define _T8CON_CKPS1_MASK                                   0x20
#define _T8CON_CKPS2_POSN                                   0x6
#define _T8CON_CKPS2_POSITION                               0x6
#define _T8CON_CKPS2_SIZE                                   0x1
#define _T8CON_CKPS2_LENGTH                                 0x1
#define _T8CON_CKPS2_MASK                                   0x40
#define _T8CON_T8OUTPS_POSN                                 0x0
#define _T8CON_T8OUTPS_POSITION                             0x0
#define _T8CON_T8OUTPS_SIZE                                 0x4
#define _T8CON_T8OUTPS_LENGTH                               0x4
#define _T8CON_T8OUTPS_MASK                                 0xF
#define _T8CON_T8CKPS_POSN                                  0x4
#define _T8CON_T8CKPS_POSITION                              0x4
#define _T8CON_T8CKPS_SIZE                                  0x3
#define _T8CON_T8CKPS_LENGTH                                0x3
#define _T8CON_T8CKPS_MASK                                  0x70
#define _T8CON_T8ON_POSN                                    0x7
#define _T8CON_T8ON_POSITION                                0x7
#define _T8CON_T8ON_SIZE                                    0x1
#define _T8CON_T8ON_LENGTH                                  0x1
#define _T8CON_T8ON_MASK                                    0x80
#define _T8CON_T8OUTPS0_POSN                                0x0
#define _T8CON_T8OUTPS0_POSITION                            0x0
#define _T8CON_T8OUTPS0_SIZE                                0x1
#define _T8CON_T8OUTPS0_LENGTH                              0x1
#define _T8CON_T8OUTPS0_MASK                                0x1
#define _T8CON_T8OUTPS1_POSN                                0x1
#define _T8CON_T8OUTPS1_POSITION                            0x1
#define _T8CON_T8OUTPS1_SIZE                                0x1
#define _T8CON_T8OUTPS1_LENGTH                              0x1
#define _T8CON_T8OUTPS1_MASK                                0x2
#define _T8CON_T8OUTPS2_POSN                                0x2
#define _T8CON_T8OUTPS2_POSITION                            0x2
#define _T8CON_T8OUTPS2_SIZE                                0x1
#define _T8CON_T8OUTPS2_LENGTH                              0x1
#define _T8CON_T8OUTPS2_MASK                                0x4
#define _T8CON_T8OUTPS3_POSN                                0x3
#define _T8CON_T8OUTPS3_POSITION                            0x3
#define _T8CON_T8OUTPS3_SIZE                                0x1
#define _T8CON_T8OUTPS3_LENGTH                              0x1
#define _T8CON_T8OUTPS3_MASK                                0x8
#define _T8CON_T8CKPS0_POSN                                 0x4
#define _T8CON_T8CKPS0_POSITION                             0x4
#define _T8CON_T8CKPS0_SIZE                                 0x1
#define _T8CON_T8CKPS0_LENGTH                               0x1
#define _T8CON_T8CKPS0_MASK                                 0x10
#define _T8CON_T8CKPS1_POSN                                 0x5
#define _T8CON_T8CKPS1_POSITION                             0x5
#define _T8CON_T8CKPS1_SIZE                                 0x1
#define _T8CON_T8CKPS1_LENGTH                               0x1
#define _T8CON_T8CKPS1_MASK                                 0x20
#define _T8CON_T8CKPS2_POSN                                 0x6
#define _T8CON_T8CKPS2_POSITION                             0x6
#define _T8CON_T8CKPS2_SIZE                                 0x1
#define _T8CON_T8CKPS2_LENGTH                               0x1
#define _T8CON_T8CKPS2_MASK                                 0x40
#define _T8CON_TMR8ON_POSN                                  0x7
#define _T8CON_TMR8ON_POSITION                              0x7
#define _T8CON_TMR8ON_SIZE                                  0x1
#define _T8CON_TMR8ON_LENGTH                                0x1
#define _T8CON_TMR8ON_MASK                                  0x80

// Register: T8HLT
#define T8HLT T8HLT
extern volatile unsigned char           T8HLT               __at(0xF2B);
#ifndef _LIB_BUILD
asm("T8HLT equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :5;
        unsigned CKSYNC                 :1;
        unsigned CKPOL                  :1;
        unsigned PSYNC                  :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
        unsigned MODE4                  :1;
    };
    struct {
        unsigned T8MODE                 :5;
        unsigned T8CKSYNC               :1;
        unsigned T8CKPOL                :1;
        unsigned T8PSYNC                :1;
    };
    struct {
        unsigned T8MODE0                :1;
        unsigned T8MODE1                :1;
        unsigned T8MODE2                :1;
        unsigned T8MODE3                :1;
        unsigned T8MODE4                :1;
    };
} T8HLTbits_t;
