MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
extern volatile T8HLTbits_t T8HLTbits __at(0xF2B);
// bitfield macros
#define _T8HLT_MODE_POSN                                    0x0
#define _T8HLT_MODE_POSITION                                0x0
#define _T8HLT_MODE_SIZE                                    0x5
#define _T8HLT_MODE_LENGTH                                  0x5
#define _T8HLT_MODE_MASK                                    0x1F
#define _T8HLT_CKSYNC_POSN                                  0x5
#define _T8HLT_CKSYNC_POSITION                              0x5
#define _T8HLT_CKSYNC_SIZE                                  0x1
#define _T8HLT_CKSYNC_LENGTH                                0x1
#define _T8HLT_CKSYNC_MASK                                  0x20
#define _T8HLT_CKPOL_POSN                                   0x6
#define _T8HLT_CKPOL_POSITION                               0x6
#define _T8HLT_CKPOL_SIZE                                   0x1
#define _T8HLT_CKPOL_LENGTH                                 0x1
#define _T8HLT_CKPOL_MASK                                   0x40
#define _T8HLT_PSYNC_POSN                                   0x7
#define _T8HLT_PSYNC_POSITION                               0x7
#define _T8HLT_PSYNC_SIZE                                   0x1
#define _T8HLT_PSYNC_LENGTH                                 0x1
#define _T8HLT_PSYNC_MASK                                   0x80
#define _T8HLT_MODE0_POSN                                   0x0
#define _T8HLT_MODE0_POSITION                               0x0
#define _T8HLT_MODE0_SIZE                                   0x1
#define _T8HLT_MODE0_LENGTH                                 0x1
#define _T8HLT_MODE0_MASK                                   0x1
#define _T8HLT_MODE1_POSN                                   0x1
#define _T8HLT_MODE1_POSITION                               0x1
#define _T8HLT_MODE1_SIZE                                   0x1
#define _T8HLT_MODE1_LENGTH                                 0x1
#define _T8HLT_MODE1_MASK                                   0x2
#define _T8HLT_MODE2_POSN                                   0x2
#define _T8HLT_MODE2_POSITION                               0x2
#define _T8HLT_MODE2_SIZE                                   0x1
#define _T8HLT_MODE2_LENGTH                                 0x1
#define _T8HLT_MODE2_MASK                                   0x4
#define _T8HLT_MODE3_POSN                                   0x3
#define _T8HLT_MODE3_POSITION                               0x3
#define _T8HLT_MODE3_SIZE                                   0x1
#define _T8HLT_MODE3_LENGTH                                 0x1
#define _T8HLT_MODE3_MASK                                   0x8
#define _T8HLT_MODE4_POSN                                   0x4
#define _T8HLT_MODE4_POSITION                               0x4
#define _T8HLT_MODE4_SIZE                                   0x1
#define _T8HLT_MODE4_LENGTH                                 0x1
#define _T8HLT_MODE4_MASK                                   0x10
#define _T8HLT_T8MODE_POSN                                  0x0
#define _T8HLT_T8MODE_POSITION                              0x0
#define _T8HLT_T8MODE_SIZE                                  0x5
#define _T8HLT_T8MODE_LENGTH                                0x5
#define _T8HLT_T8MODE_MASK                                  0x1F
#define _T8HLT_T8CKSYNC_POSN                                0x5
#define _T8HLT_T8CKSYNC_POSITION                            0x5
#define _T8HLT_T8CKSYNC_SIZE                                0x1
#define _T8HLT_T8CKSYNC_LENGTH                              0x1
#define _T8HLT_T8CKSYNC_MASK                                0x20
#define _T8HLT_T8CKPOL_POSN                                 0x6
#define _T8HLT_T8CKPOL_POSITION                             0x6
#define _T8HLT_T8CKPOL_SIZE                                 0x1
#define _T8HLT_T8CKPOL_LENGTH                               0x1
#define _T8HLT_T8CKPOL_MASK                                 0x40
#define _T8HLT_T8PSYNC_POSN                                 0x7
#define _T8HLT_T8PSYNC_POSITION                             0x7
#define _T8HLT_T8PSYNC_SIZE                                 0x1
#define _T8HLT_T8PSYNC_LENGTH                               0x1
#define _T8HLT_T8PSYNC_MASK                                 0x80
#define _T8HLT_T8MODE0_POSN                                 0x0
#define _T8HLT_T8MODE0_POSITION                             0x0
#define _T8HLT_T8MODE0_SIZE                                 0x1
#define _T8HLT_T8MODE0_LENGTH                               0x1
#define _T8HLT_T8MODE0_MASK                                 0x1
#define _T8HLT_T8MODE1_POSN                                 0x1
#define _T8HLT_T8MODE1_POSITION                             0x1
#define _T8HLT_T8MODE1_SIZE                                 0x1
#define _T8HLT_T8MODE1_LENGTH                               0x1
#define _T8HLT_T8MODE1_MASK                                 0x2
#define _T8HLT_T8MODE2_POSN                                 0x2
#define _T8HLT_T8MODE2_POSITION                             0x2
#define _T8HLT_T8MODE2_SIZE                                 0x1
#define _T8HLT_T8MODE2_LENGTH                               0x1
#define _T8HLT_T8MODE2_MASK                                 0x4
#define _T8HLT_T8MODE3_POSN                                 0x3
#define _T8HLT_T8MODE3_POSITION                             0x3
#define _T8HLT_T8MODE3_SIZE                                 0x1
#define _T8HLT_T8MODE3_LENGTH                               0x1
#define _T8HLT_T8MODE3_MASK                                 0x8
#define _T8HLT_T8MODE4_POSN                                 0x4
#define _T8HLT_T8MODE4_POSITION                             0x4
#define _T8HLT_T8MODE4_SIZE                                 0x1
#define _T8HLT_T8MODE4_LENGTH                               0x1
#define _T8HLT_T8MODE4_MASK                                 0x10

// Register: T8CLKCON
#define T8CLKCON T8CLKCON
extern volatile unsigned char           T8CLKCON            __at(0xF2C);
#ifndef _LIB_BUILD
asm("T8CLKCON equ 0F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :4;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
    struct {
        unsigned T8CS                   :4;
    };
    struct {
        unsigned T8CS0                  :1;
        unsigned T8CS1                  :1;
        unsigned T8CS2                  :1;
        unsigned T8CS3                  :1;
    };
} T8CLKCONbits_t;
extern volatile T8CLKCONbits_t T8CLKCONbits __at(0xF2C);
// bitfield macros
#define _T8CLKCON_CS_POSN                                   0x0
#define _T8CLKCON_CS_POSITION                               0x0
#define _T8CLKCON_CS_SIZE                                   0x4
#define _T8CLKCON_CS_LENGTH                                 0x4
#define _T8CLKCON_CS_MASK                                   0xF
#define _T8CLKCON_CS0_POSN                                  0x0
#define _T8CLKCON_CS0_POSITION                              0x0
#define _T8CLKCON_CS0_SIZE                                  0x1
#define _T8CLKCON_CS0_LENGTH                                0x1
#define _T8CLKCON_CS0_MASK                                  0x1
#define _T8CLKCON_CS1_POSN                                  0x1
#define _T8CLKCON_CS1_POSITION                              0x1
#define _T8CLKCON_CS1_SIZE                                  0x1
#define _T8CLKCON_CS1_LENGTH                                0x1
#define _T8CLKCON_CS1_MASK                                  0x2
#define _T8CLKCON_CS2_POSN                                  0x2
#define _T8CLKCON_CS2_POSITION                              0x2
#define _T8CLKCON_CS2_SIZE                                  0x1
#define _T8CLKCON_CS2_LENGTH                                0x1
#define _T8CLKCON_CS2_MASK                                  0x4
#define _T8CLKCON_CS3_POSN                                  0x3
#define _T8CLKCON_CS3_POSITION                              0x3
#define _T8CLKCON_CS3_SIZE                                  0x1
#define _T8CLKCON_CS3_LENGTH                                0x1
#define _T8CLKCON_CS3_MASK                                  0x8
#define _T8CLKCON_T8CS_POSN                                 0x0
#define _T8CLKCON_T8CS_POSITION                             0x0
#define _T8CLKCON_T8CS_SIZE                                 0x4
#define _T8CLKCON_T8CS_LENGTH                               0x4
#define _T8CLKCON_T8CS_MASK                                 0xF
#define _T8CLKCON_T8CS0_POSN                                0x0
#define _T8CLKCON_T8CS0_POSITION                            0x0
#define _T8CLKCON_T8CS0_SIZE                                0x1
#define _T8CLKCON_T8CS0_LENGTH                              0x1
#define _T8CLKCON_T8CS0_MASK                                0x1
#define _T8CLKCON_T8CS1_POSN                                0x1
#define _T8CLKCON_T8CS1_POSITION                            0x1
#define _T8CLKCON_T8CS1_SIZE                                0x1
#define _T8CLKCON_T8CS1_LENGTH                              0x1
#define _T8CLKCON_T8CS1_MASK                                0x2
#define _T8CLKCON_T8CS2_POSN                                0x2
#define _T8CLKCON_T8CS2_POSITION                            0x2
#define _T8CLKCON_T8CS2_SIZE                                0x1
#define _T8CLKCON_T8CS2_LENGTH                              0x1
#define _T8CLKCON_T8CS2_MASK                                0x4
#define _T8CLKCON_T8CS3_POSN                                0x3
#define _T8CLKCON_T8CS3_POSITION                            0x3
#define _T8CLKCON_T8CS3_SIZE                                0x1
#define _T8CLKCON_T8CS3_LENGTH                              0x1
#define _T8CLKCON_T8CS3_MASK                                0x8

// Register: T8RST
#define T8RST T8RST
extern volatile unsigned char           T8RST               __at(0xF2D);
#ifndef _LIB_BUILD
asm("T8RST equ 0F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSEL                   :4;
    };
    struct {
        unsigned RSEL0                  :1;
        unsigned RSEL1                  :1;
        unsigned RSEL2                  :1;
        unsigned RSEL3                  :1;
    };
    struct {
        unsigned T8RSEL                 :4;
    };
    struct {
        unsigned T8RSEL0                :1;
        unsigned T8RSEL1                :1;
        unsigned T8RSEL2                :1;
        unsigned T8RSEL3                :1;
    };
} T8RSTbits_t;
extern volatile T8RSTbits_t T8RSTbits __at(0xF2D);
// bitfield macros
#define _T8RST_RSEL_POSN                                    0x0
#define _T8RST_RSEL_POSITION                                0x0
#define _T8RST_RSEL_SIZE                                    0x4
#define _T8RST_RSEL_LENGTH                                  0x4
#define _T8RST_RSEL_MASK                                    0xF
#define _T8RST_RSEL0_POSN                                   0x0
#define _T8RST_RSEL0_POSITION                               0x0
#define _T8RST_RSEL0_SIZE                                   0x1
#define _T8RST_RSEL0_LENGTH                                 0x1
#define _T8RST_RSEL0_MASK                                   0x1
#define _T8RST_RSEL1_POSN                                   0x1
#define _T8RST_RSEL1_POSITION                               0x1
#define _T8RST_RSEL1_SIZE                                   0x1
#define _T8RST_RSEL1_LENGTH                                 0x1
#define _T8RST_RSEL1_MASK                                   0x2
#define _T8RST_RSEL2_POSN                                   0x2
#define _T8RST_RSEL2_POSITION                               0x2
#define _T8RST_RSEL2_SIZE                                   0x1
#define _T8RST_RSEL2_LENGTH                                 0x1
#define _T8RST_RSEL2_MASK                                   0x4
#define _T8RST_RSEL3_POSN                                   0x3
#define _T8RST_RSEL3_POSITION                               0x3
#define _T8RST_RSEL3_SIZE                                   0x1
#define _T8RST_RSEL3_LENGTH                                 0x1
#define _T8RST_RSEL3_MASK                                   0x8
#define _T8RST_T8RSEL_POSN                                  0x0
#define _T8RST_T8RSEL_POSITION                              0x0
#define _T8RST_T8RSEL_SIZE                                  0x4
#define _T8RST_T8RSEL_LENGTH                                0x4
#define _T8RST_T8RSEL_MASK                                  0xF
#define _T8RST_T8RSEL0_POSN                                 0x0
#define _T8RST_T8RSEL0_POSITION                             0x0
#define _T8RST_T8RSEL0_SIZE                                 0x1
#define _T8RST_T8RSEL0_LENGTH                               0x1
#define _T8RST_T8RSEL0_MASK                                 0x1
#define _T8RST_T8RSEL1_POSN                                 0x1
#define _T8RST_T8RSEL1_POSITION                             0x1
#define _T8RST_T8RSEL1_SIZE                                 0x1
#define _T8RST_T8RSEL1_LENGTH                               0x1
#define _T8RST_T8RSEL1_MASK                                 0x2
#define _T8RST_T8RSEL2_POSN                                 0x2
#define _T8RST_T8RSEL2_POSITION                             0x2
#define _T8RST_T8RSEL2_SIZE                                 0x1
#define _T8RST_T8RSEL2_LENGTH                               0x1
#define _T8RST_T8RSEL2_MASK                                 0x4
#define _T8RST_T8RSEL3_POSN                                 0x3
#define _T8RST_T8RSEL3_POSITION                             0x3
#define _T8RST_T8RSEL3_SIZE                                 0x1
#define _T8RST_T8RSEL3_LENGTH                               0x1
#define _T8RST_T8RSEL3_MASK                                 0x8

// Register: TMR7
#define TMR7 TMR7
extern volatile unsigned short          TMR7                __at(0xF2E);
#ifndef _LIB_BUILD
asm("TMR7 equ 0F2Eh");
#endif

// Register: TMR7L
#define TMR7L TMR7L
extern volatile unsigned char           TMR7L               __at(0xF2E);
#ifndef _LIB_BUILD
asm("TMR7L equ 0F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR7L0                 :1;
        unsigned TMR7L1                 :1;
        unsigned TMR7L2                 :1;
        unsigned TMR7L3                 :1;
        unsigned TMR7L4                 :1;
        unsigned TMR7L5                 :1;
        unsigned TMR7L6                 :1;
        unsigned TMR7L7                 :1;
    };
    struct {
        unsigned TMR7L                  :8;
    };
    struct {
        unsigned TMR70                  :1;
        unsigned TMR71                  :1;
        unsigned TMR72                  :1;
        unsigned TMR73                  :1;
        unsigned TMR74                  :1;
        unsigned TMR75                  :1;
        unsigned TMR76                  :1;
        unsigned TMR77                  :1;
    };
    struct {
        unsigned CAL07                  :1;
        unsigned CAL17                  :1;
        unsigned CAL27                  :1;
        unsigned CAL37                  :1;
        unsigned CAL47                  :1;
        unsigned CAL57                  :1;
        unsigned CAL67                  :1;
        unsigned CAL77                  :1;
    };
} TMR7Lbits_t;
extern volatile TMR7Lbits_t TMR7Lbits __at(0xF2E);
// bitfield macros
#define _TMR7L_TMR7L0_POSN                                  0x0
#define _TMR7L_TMR7L0_POSITION                              0x0
#define _TMR7L_TMR7L0_SIZE                                  0x1
#define _TMR7L_TMR7L0_LENGTH                                0x1
#define _TMR7L_TMR7L0_MASK                                  0x1
#define _TMR7L_TMR7L1_POSN                                  0x1
#define _TMR7L_TMR7L1_POSITION                              0x1
#define _TMR7L_TMR7L1_SIZE                                  0x1
#define _TMR7L_TMR7L1_LENGTH                                0x1
#define _TMR7L_TMR7L1_MASK                                  0x2
#define _TMR7L_TMR7L2_POSN                                  0x2
#define _TMR7L_TMR7L2_POSITION                              0x2
#define _TMR7L_TMR7L2_SIZE                                  0x1
#define _TMR7L_TMR7L2_LENGTH                                0x1
#define _TMR7L_TMR7L2_MASK                                  0x4
#define _TMR7L_TMR7L3_POSN                                  0x3
#define _TMR7L_TMR7L3_POSITION                              0x3
#define _TMR7L_TMR7L3_SIZE                                  0x1
#define _TMR7L_TMR7L3_LENGTH                                0x1
#define _TMR7L_TMR7L3_MASK                                  0x8
#define _TMR7L_TMR7L4_POSN                                  0x4
#define _TMR7L_TMR7L4_POSITION                              0x4
#define _TMR7L_TMR7L4_SIZE                                  0x1
#define _TMR7L_TMR7L4_LENGTH                                0x1
#define _TMR7L_TMR7L4_MASK                                  0x10
#define _TMR7L_TMR7L5_POSN                                  0x5
#define _TMR7L_TMR7L5_POSITION                              0x5
#define _TMR7L_TMR7L5_SIZE                                  0x1
#define _TMR7L_TMR7L5_LENGTH                                0x1
#define _TMR7L_TMR7L5_MASK                                  0x20
#define _TMR7L_TMR7L6_POSN                                  0x6
#define _TMR7L_TMR7L6_POSITION                              0x6
#define _TMR7L_TMR7L6_SIZE                                  0x1
#define _TMR7L_TMR7L6_LENGTH                                0x1
#define _TMR7L_TMR7L6_MASK                                  0x40
#define _TMR7L_TMR7L7_POSN                                  0x7
#define _TMR7L_TMR7L7_POSITION                              0x7
#define _TMR7L_TMR7L7_SIZE                                  0x1
#define _TMR7L_TMR7L7_LENGTH                                0x1
#define _TMR7L_TMR7L7_MASK                                  0x80
#define _TMR7L_TMR7L_POSN                                   0x0
#define _TMR7L_TMR7L_POSITION                               0x0
#define _TMR7L_TMR7L_SIZE                                   0x8
#define _TMR7L_TMR7L_LENGTH                                 0x8
#define _TMR7L_TMR7L_MASK                                   0xFF
#define _TMR7L_TMR70_POSN                                   0x0
#define _TMR7L_TMR70_POSITION                               0x0
#define _TMR7L_TMR70_SIZE                                   0x1
#define _TMR7L_TMR70_LENGTH                                 0x1
#define _TMR7L_TMR70_MASK                                   0x1
#define _TMR7L_TMR71_POSN                                   0x1
#define _TMR7L_TMR71_POSITION                               0x1
#define _TMR7L_TMR71_SIZE                                   0x1
#define _TMR7L_TMR71_LENGTH                                 0x1
#define _TMR7L_TMR71_MASK                                   0x2
#define _TMR7L_TMR72_POSN                                   0x2
#define _TMR7L_TMR72_POSITION                               0x2
#define _TMR7L_TMR72_SIZE                                   0x1
#define _TMR7L_TMR72_LENGTH                                 0x1
#define _TMR7L_TMR72_MASK                                   0x4
#define _TMR7L_TMR73_POSN                                   0x3
#define _TMR7L_TMR73_POSITION                               0x3
#define _TMR7L_TMR73_SIZE                                   0x1
#define _TMR7L_TMR73_LENGTH                                 0x1
#define _TMR7L_TMR73_MASK                                   0x8
#define _TMR7L_TMR74_POSN                                   0x4
#define _TMR7L_TMR74_POSITION                               0x4
#define _TMR7L_TMR74_SIZE                                   0x1
#define _TMR7L_TMR74_LENGTH                                 0x1
#define _TMR7L_TMR74_MASK                                   0x10
#define _TMR7L_TMR75_POSN                                   0x5
#define _TMR7L_TMR75_POSITION                               0x5
#define _TMR7L_TMR75_SIZE                                   0x1
#define _TMR7L_TMR75_LENGTH                                 0x1
#define _TMR7L_TMR75_MASK                                   0x20
#define _TMR7L_TMR76_POSN                                   0x6
#define _TMR7L_TMR76_POSITION                               0x6
#define _TMR7L_TMR76_SIZE                                   0x1
#define _TMR7L_TMR76_LENGTH                                 0x1
#define _TMR7L_TMR76_MASK                                   0x40
#define _TMR7L_TMR77_POSN                                   0x7
#define _TMR7L_TMR77_POSITION                               0x7
#define _TMR7L_TMR77_SIZE                                   0x1
#define _TMR7L_TMR77_LENGTH                                 0x1
#define _TMR7L_TMR77_MASK                                   0x80
#define _TMR7L_CAL07_POSN                                   0x0
#define _TMR7L_CAL07_POSITION                               0x0
#define _TMR7L_CAL07_SIZE                                   0x1
#define _TMR7L_CAL07_LENGTH                                 0x1
#define _TMR7L_CAL07_MASK                                   0x1
#define _TMR7L_CAL17_POSN                                   0x1
#define _TMR7L_CAL17_POSITION                               0x1
#define _TMR7L_CAL17_SIZE                                   0x1
#define _TMR7L_CAL17_LENGTH                                 0x1
#define _TMR7L_CAL17_MASK                                   0x2
#define _TMR7L_CAL27_POSN                                   0x2
#define _TMR7L_CAL27_POSITION                               0x2
#define _TMR7L_CAL27_SIZE                                   0x1
#define _TMR7L_CAL27_LENGTH                                 0x1
#define _TMR7L_CAL27_MASK                                   0x4
#define _TMR7L_CAL37_POSN                                   0x3
#define _TMR7L_CAL37_POSITION                               0x3
#define _TMR7L_CAL37_SIZE                                   0x1
#define _TMR7L_CAL37_LENGTH                                 0x1
#define _TMR7L_CAL37_MASK                                   0x8
#define _TMR7L_CAL47_POSN                                   0x4
#define _TMR7L_CAL47_POSITION                               0x4
#define _TMR7L_CAL47_SIZE                                   0x1
#define _TMR7L_CAL47_LENGTH                                 0x1
#define _TMR7L_CAL47_MASK                                   0x10
#define _TMR7L_CAL57_POSN                                   0x5
#define _TMR7L_CAL57_POSITION                               0x5
#define _TMR7L_CAL57_SIZE                                   0x1
#define _TMR7L_CAL57_LENGTH                                 0x1
#define _TMR7L_CAL57_MASK                                   0x20
#define _TMR7L_CAL67_POSN                                   0x6
#define _TMR7L_CAL67_POSITION                               0x6
#define _TMR7L_CAL67_SIZE                                   0x1
#define _TMR7L_CAL67_LENGTH                                 0x1
#define _TMR7L_CAL67_MASK                                   0x40
#define _TMR7L_CAL77_POSN                                   0x7
#define _TMR7L_CAL77_POSITION                               0x7
#define _TMR7L_CAL77_SIZE                                   0x1
#define _TMR7L_CAL77_LENGTH                                 0x1
#define _TMR7L_CAL77_MASK                                   0x80

