MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K40/mcu.h
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x7D3B);	// @ (0xFA7 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x7018);	// @ (0xE03 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x7019);	// @ (0xE03 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x701A);	// @ (0xE03 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x701B);	// @ (0xE03 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x701C);	// @ (0xE03 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0x701D);	// @ (0xE03 * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CAP<CCP3CTS3>
extern volatile __bit                   CCP3CTS3            __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 CCP3CTS3_bit        _BIT_ACCESS(CCP3CAP,3)
// CCP3CAP<CCP3CTS4>
extern volatile __bit                   CCP3CTS4            __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 CCP3CTS4_bit        _BIT_ACCESS(CCP3CAP,4)
// CCP3CAP<CCP3CTS5>
extern volatile __bit                   CCP3CTS5            __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 CCP3CTS5_bit        _BIT_ACCESS(CCP3CAP,5)
// CCP3CAP<CCP3CTS6>
extern volatile __bit                   CCP3CTS6            __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 CCP3CTS6_bit        _BIT_ACCESS(CCP3CAP,6)
// CCP3CAP<CCP3CTS7>
extern volatile __bit                   CCP3CTS7            __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 CCP3CTS7_bit        _BIT_ACCESS(CCP3CAP,7)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE7<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE7,2)
// PIR7<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x71D2);	// @ (0xE3A * 8 + 2)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR7,2)
// IPR7<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR7,2)
// PMD4<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x7282);	// @ (0xE50 * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD4,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OE>
extern volatile __bit                   CCP3OE              __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 CCP3OE_bit          _BIT_ACCESS(CCP3CON,6)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP3PPS<CCP3PPS0>
extern volatile __bit                   CCP3PPS0            __at(0x7020);	// @ (0xE04 * 8 + 0)
#define                                 CCP3PPS0_bit        _BIT_ACCESS(CCP3PPS,0)
// CCP3PPS<CCP3PPS1>
extern volatile __bit                   CCP3PPS1            __at(0x7021);	// @ (0xE04 * 8 + 1)
#define                                 CCP3PPS1_bit        _BIT_ACCESS(CCP3PPS,1)
// CCP3PPS<CCP3PPS2>
extern volatile __bit                   CCP3PPS2            __at(0x7022);	// @ (0xE04 * 8 + 2)
#define                                 CCP3PPS2_bit        _BIT_ACCESS(CCP3PPS,2)
// CCP3PPS<CCP3PPS3>
extern volatile __bit                   CCP3PPS3            __at(0x7023);	// @ (0xE04 * 8 + 3)
#define                                 CCP3PPS3_bit        _BIT_ACCESS(CCP3PPS,3)
// CCP3PPS<CCP3PPS4>
extern volatile __bit                   CCP3PPS4            __at(0x7024);	// @ (0xE04 * 8 + 4)
#define                                 CCP3PPS4_bit        _BIT_ACCESS(CCP3PPS,4)
// CCP3PPS<CCP3PPS5>
extern volatile __bit                   CCP3PPS5            __at(0x7025);	// @ (0xE04 * 8 + 5)
#define                                 CCP3PPS5_bit        _BIT_ACCESS(CCP3PPS,5)
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 CCP4CTS0_bit        _BIT_ACCESS(CCP4CAP,0)
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 CCP4CTS1_bit        _BIT_ACCESS(CCP4CAP,1)
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 CCP4CTS2_bit        _BIT_ACCESS(CCP4CAP,2)
// CCP4CAP<CCP4CTS3>
extern volatile __bit                   CCP4CTS3            __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 CCP4CTS3_bit        _BIT_ACCESS(CCP4CAP,3)
// CCP4CAP<CCP4CTS4>
extern volatile __bit                   CCP4CTS4            __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 CCP4CTS4_bit        _BIT_ACCESS(CCP4CAP,4)
// CCP4CAP<CCP4CTS5>
extern volatile __bit                   CCP4CTS5            __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 CCP4CTS5_bit        _BIT_ACCESS(CCP4CAP,5)
// CCP4CAP<CCP4CTS6>
extern volatile __bit                   CCP4CTS6            __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 CCP4CTS6_bit        _BIT_ACCESS(CCP4CAP,6)
// CCP4CAP<CCP4CTS7>
extern volatile __bit                   CCP4CTS7            __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 CCP4CTS7_bit        _BIT_ACCESS(CCP4CAP,7)
// CCP4CON<CCP4EN>
extern volatile __bit                   CCP4EN              __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 CCP4EN_bit          _BIT_ACCESS(CCP4CON,7)
// CCP4CON<CCP4FMT>
extern volatile __bit                   CCP4FMT             __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 CCP4FMT_bit         _BIT_ACCESS(CCP4CON,4)
// PIE7<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE7,3)
// PIR7<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x71D3);	// @ (0xE3A * 8 + 3)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR7,3)
// IPR7<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR7,3)
// PMD4<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x7283);	// @ (0xE50 * 8 + 3)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD4,3)
// CCP4CON<CCP4MODE0>
extern volatile __bit                   CCP4MODE0           __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 CCP4MODE0_bit       _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4MODE1>
extern volatile __bit                   CCP4MODE1           __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 CCP4MODE1_bit       _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4MODE2>
extern volatile __bit                   CCP4MODE2           __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 CCP4MODE2_bit       _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4MODE3>
extern volatile __bit                   CCP4MODE3           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 CCP4MODE3_bit       _BIT_ACCESS(CCP4CON,3)
// CCP4CON<CCP4OE>
extern volatile __bit                   CCP4OE              __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 CCP4OE_bit          _BIT_ACCESS(CCP4CON,6)
// CCP4CON<CCP4OUT>
extern volatile __bit                   CCP4OUT             __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 CCP4OUT_bit         _BIT_ACCESS(CCP4CON,5)
// CCP4PPS<CCP4PPS0>
extern volatile __bit                   CCP4PPS0            __at(0x7028);	// @ (0xE05 * 8 + 0)
#define                                 CCP4PPS0_bit        _BIT_ACCESS(CCP4PPS,0)
// CCP4PPS<CCP4PPS1>
extern volatile __bit                   CCP4PPS1            __at(0x7029);	// @ (0xE05 * 8 + 1)
#define                                 CCP4PPS1_bit        _BIT_ACCESS(CCP4PPS,1)
// CCP4PPS<CCP4PPS2>
extern volatile __bit                   CCP4PPS2            __at(0x702A);	// @ (0xE05 * 8 + 2)
#define                                 CCP4PPS2_bit        _BIT_ACCESS(CCP4PPS,2)
// CCP4PPS<CCP4PPS3>
extern volatile __bit                   CCP4PPS3            __at(0x702B);	// @ (0xE05 * 8 + 3)
#define                                 CCP4PPS3_bit        _BIT_ACCESS(CCP4PPS,3)
// CCP4PPS<CCP4PPS4>
extern volatile __bit                   CCP4PPS4            __at(0x702C);	// @ (0xE05 * 8 + 4)
#define                                 CCP4PPS4_bit        _BIT_ACCESS(CCP4PPS,4)
// CCP4PPS<CCP4PPS5>
extern volatile __bit                   CCP4PPS5            __at(0x702D);	// @ (0xE05 * 8 + 5)
#define                                 CCP4PPS5_bit        _BIT_ACCESS(CCP4PPS,5)
// CCP5CAP<CCP5CTS0>
extern volatile __bit                   CCP5CTS0            __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 CCP5CTS0_bit        _BIT_ACCESS(CCP5CAP,0)
// CCP5CAP<CCP5CTS1>
extern volatile __bit                   CCP5CTS1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 CCP5CTS1_bit        _BIT_ACCESS(CCP5CAP,1)
// CCP5CAP<CCP5CTS2>
extern volatile __bit                   CCP5CTS2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 CCP5CTS2_bit        _BIT_ACCESS(CCP5CAP,2)
// CCP5CAP<CCP5CTS3>
extern volatile __bit                   CCP5CTS3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 CCP5CTS3_bit        _BIT_ACCESS(CCP5CAP,3)
// CCP5CAP<CCP5CTS4>
extern volatile __bit                   CCP5CTS4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 CCP5CTS4_bit        _BIT_ACCESS(CCP5CAP,4)
// CCP5CAP<CCP5CTS5>
extern volatile __bit                   CCP5CTS5            __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 CCP5CTS5_bit        _BIT_ACCESS(CCP5CAP,5)
// CCP5CAP<CCP5CTS6>
extern volatile __bit                   CCP5CTS6            __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 CCP5CTS6_bit        _BIT_ACCESS(CCP5CAP,6)
// CCP5CAP<CCP5CTS7>
extern volatile __bit                   CCP5CTS7            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 CCP5CTS7_bit        _BIT_ACCESS(CCP5CAP,7)
// CCP5CON<CCP5EN>
extern volatile __bit                   CCP5EN              __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 CCP5EN_bit          _BIT_ACCESS(CCP5CON,7)
// CCP5CON<CCP5FMT>
extern volatile __bit                   CCP5FMT             __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 CCP5FMT_bit         _BIT_ACCESS(CCP5CON,4)
// PIE7<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE7,4)
// PIR7<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x71D4);	// @ (0xE3A * 8 + 4)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR7,4)
// IPR7<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR7,4)
// PMD4<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x7284);	// @ (0xE50 * 8 + 4)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD4,4)
// CCP5CON<CCP5MODE0>
extern volatile __bit                   CCP5MODE0           __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 CCP5MODE0_bit       _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5MODE1>
extern volatile __bit                   CCP5MODE1           __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 CCP5MODE1_bit       _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5MODE2>
extern volatile __bit                   CCP5MODE2           __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 CCP5MODE2_bit       _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5MODE3>
extern volatile __bit                   CCP5MODE3           __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 CCP5MODE3_bit       _BIT_ACCESS(CCP5CON,3)
// CCP5CON<CCP5OE>
extern volatile __bit                   CCP5OE              __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 CCP5OE_bit          _BIT_ACCESS(CCP5CON,6)
// CCP5CON<CCP5OUT>
extern volatile __bit                   CCP5OUT             __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 CCP5OUT_bit         _BIT_ACCESS(CCP5CON,5)
// CCP5PPS<CCP5PPS0>
extern volatile __bit                   CCP5PPS0            __at(0x7030);	// @ (0xE06 * 8 + 0)
#define                                 CCP5PPS0_bit        _BIT_ACCESS(CCP5PPS,0)
// CCP5PPS<CCP5PPS1>
extern volatile __bit                   CCP5PPS1            __at(0x7031);	// @ (0xE06 * 8 + 1)
#define                                 CCP5PPS1_bit        _BIT_ACCESS(CCP5PPS,1)
// CCP5PPS<CCP5PPS2>
extern volatile __bit                   CCP5PPS2            __at(0x7032);	// @ (0xE06 * 8 + 2)
#define                                 CCP5PPS2_bit        _BIT_ACCESS(CCP5PPS,2)
// CCP5PPS<CCP5PPS3>
extern volatile __bit                   CCP5PPS3            __at(0x7033);	// @ (0xE06 * 8 + 3)
#define                                 CCP5PPS3_bit        _BIT_ACCESS(CCP5PPS,3)
// CCP5PPS<CCP5PPS4>
extern volatile __bit                   CCP5PPS4            __at(0x7034);	// @ (0xE06 * 8 + 4)
#define                                 CCP5PPS4_bit        _BIT_ACCESS(CCP5PPS,4)
// CCP5PPS<CCP5PPS5>
extern volatile __bit                   CCP5PPS5            __at(0x7035);	// @ (0xE06 * 8 + 5)
#define                                 CCP5PPS5_bit        _BIT_ACCESS(CCP5PPS,5)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C6C);	// @ (0xF8D * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x7623);	// @ (0xEC4 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x7220);	// @ (0xE44 * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x7221);	// @ (0xE44 * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x7222);	// @ (0xE44 * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x7223);	// @ (0xE44 * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MDCON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x7A95);	// @ (0xF52 * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MDCON1,5)
// MDCARH<CHS0>
extern volatile __bit                   CHS0                __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 CHS0_bit            _BIT_ACCESS(MDCARH,0)
// MDCARH<CHS1>
extern volatile __bit                   CHS1                __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 CHS1_bit            _BIT_ACCESS(MDCARH,1)
// MDCARH<CHS2>
extern volatile __bit                   CHS2                __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 CHS2_bit            _BIT_ACCESS(MDCARH,2)
// MDCARH<CHS3>
extern volatile __bit                   CHS3                __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 CHS3_bit            _BIT_ACCESS(MDCARH,3)
// MDCON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MDCON1,4)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x76C6);	// @ (0xED8 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x76CC);	// @ (0xED9 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUD1CON<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUD1CON,4)
// CLKRCLK<CLK0>
extern volatile __bit                   CLK0                __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 CLK0_bit            _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLK1>
extern volatile __bit                   CLK1                __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 CLK1_bit            _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLK2>
extern volatile __bit                   CLK2                __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 CLK2_bit            _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x79A3);	// @ (0xF34 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x7261);	// @ (0xE4C * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// MDCON1<CLPOL>
